[
  {
    "title": "Build Your Own Arduino Workshop",
    "author": [
      {
        "name": "Clay Dowling",
        "bio": "Clay Dowling is a software consultant specializing in agile practices & extremem programming techniques. In his spare time he builds machines driven by microcontrollers & negotiates with his cats for access to the keyboard."
      }, 
      {
        "name": "Nathan Schlehlein",
        "bio": "Nathan Schlehlein is a wannabe problem solver who earns his living making dreams come true for people via software. A semi-recent transplant to the semi-bustling city of Des Moines, IA, he resides in the “pretty OK” western burbs with his three awesome kids, long-suffering wife, & hyperactive dog. He is an enthusiast of intriguing, historically significant, & / or dangerous technology & enjoys good scotch, beer with a back story, & a well-executed fake foreign accent."
      }
    ],
    "description": "Participants in this workshop will be handed a shifty looking baggie full of inexpensive parts which they will use to create their very own Arduino - compatible microcontroller board. While constructing the board, we’ll discuss & tinker with each component (clock source, power regulation, etc.) to see how they work. Then we’ll boot ‘em up & (provided the blue smoke hasn’t escaped by this point) start writing some code & talking to some devices."
  },
  {
    "title": "Network Analysis Workshop",
    "author": [
      {
        "name": "Brad Miller",
        "bio": "Brad Miller is an instructor and testbed technician with Nebraska Applied Research Institute (NARI), where he trains attendees of NARIs cyber security courses and designs and develops testbeds for companies. He joined the NARI team in 2017 after retiring from the US Marine Corps. While he was on active duty, he maintained F-18 Hornets for Marine Aviation and had the opportunity to achieve his Master Training Specialist certification. Brad has instructed attendees from Cyber Protection Brigade, Iowa National Guard and Defense Threat Reduction Agency during courses and has worked with Honeywell and Siemens components during testbed development, among other distinctions in the cyber security field for NARI. Brad helps the building control systems (BCS) industry by giving facility and building engineers cutting edge training in BCS cyber security techniques. He also gives NARIs cyber engineers a platform with the testbeds, allowing them to develop new BCS hardening techniques and data."
      }, 
      {
        "name": "Josh Bunstock",
        "bio": "Josh Bunstock is the Cyber Training and Instructional Design Lead at the Nebraska Applied Research Institute.  Josh has taken part in the development and delivery of four separate courses for NARI including Network Analysis, Executive Cyber Security, Building Control System Incident Response, and NIST Special Publication 800-171 Compliance for Businesses.  He joined the NARI team in July of 2017 after transitioning from 20 years of service in the Navy’s Submarine Force.  While in the Navy, Josh achieved Master Training Specialist Mentor status establishing him as an expert in his craft.  His Navy background included work as an instructor, electronics technician, security program manager, undersea research and design technician, and more.  He holds a Bachelor’s degree in Applied Science and Technology with an emphasis in electronics and is pursuing a Master’s degree in Instructional Technology."
      }, 
      {
        "name": "Dr. Owen Redwood",
        "bio": "Dr. Owen Redwood is the Chief Research Officer at NARI. Dr. Redwood earned his M.S. and Ph.D. degrees in Computer Science from the Florida State University, focusing on vulnerability research and virtualization research of cyber physical systems. Dr. Redwood earned his B.S. in Computer Science from the Georgia Institute of Technology. His research background spans IT and OT vulnerability research, reverse engineering, cyber physical systems virtualization research, hybrid approaches for static/dynamic/symbolic analysis, physical-impact payload development, and automated exploitation and mitigation. Dr. Redwood also created and maintains the “Offensive Computer Security” online open-courseware which has been adopted by faculty members at over 20 universities and is the world’s top open-courseware on vulnerability research and exploitation. In a past life, Dr. Redwood was a member of the Raytheon Deep Red team for the DARPA Cyber Grand Challenge, where he focused on automating vulnerability discovery, vulnerability mitigation, and exploitation.  He also previously worked for Sandia National Labs and another government cybersecurity research and development organization focusing on securing critical infrastructure. Dr. Redwood’s past cyber physical system vulnerability research has covered devices in energy critical infrastructure, oil/gas critical infrastructure, maritime systems, vehicular systems, building automation systems, and more. Dr. Redwood has a Global Industrial Cyber Security Professional (GICSP) certification, and has passed the CISSP exam and is awaiting the CISSP certification award currently."
      }
    ],
    "description": "Students learn how to use Wireshark to analyze multiple protocols within the common IT network stack. Students gain multiple hours of hands-on experience and essential skills for analyzing network traffic on Information Technology (IT) and Operational Technology (OT) networks.",
    "extra": [
      "A basic understanding of IT and OT networks including but not limited to the OSI model, the TCP/IP model, and network taps. Students also learn the differences between IT (information management) networks and OT (physical operations systems) networks and how to capture and analyze network traffic.",
      "A basic understanding of CANbus, BACnet, and other control system protocols and technologies.",
      "A basic understanding of how to use GrassMarlin to analyze network traffic and relationships.",
      "How to setup and conögure Wireshark for use in packet capture and analysis.",
      "How to use Wireshark to capture packets from IT networks and perform analysis of captured packets, as well as access and analyze network traffic commonly found on IT and OT networks."
    ]
  },
  {
    "title": "Building Control System - Incident Response",
    "author": [
      {
        "name": "Brad Miller",
        "bio": "Brad Miller is an instructor and testbed technician with Nebraska Applied Research Institute (NARI), where he trains attendees of NARIs cyber security courses and designs and develops testbeds for companies. He joined the NARI team in 2017 after retiring from the US Marine Corps. While he was on active duty, he maintained F-18 Hornets for Marine Aviation and had the opportunity to achieve his Master Training Specialist certification. Brad has instructed attendees from Cyber Protection Brigade, Iowa National Guard and Defense Threat Reduction Agency during courses and has worked with Honeywell and Siemens components during testbed development, among other distinctions in the cyber security field for NARI. Brad helps the building control systems (BCS) industry by giving facility and building engineers cutting edge training in BCS cyber security techniques. He also gives NARIs cyber engineers a platform with the testbeds, allowing them to develop new BCS hardening techniques and data."
      }, 
      {
        "name": "Josh Bunstock",
        "bio": "Josh Bunstock is the Cyber Training and Instructional Design Lead at the Nebraska Applied Research Institute.  Josh has taken part in the development and delivery of four separate courses for NARI including Network Analysis, Executive Cyber Security, Building Control System Incident Response, and NIST Special Publication 800-171 Compliance for Businesses.  He joined the NARI team in July of 2017 after transitioning from 20 years of service in the Navy’s Submarine Force.  While in the Navy, Josh achieved Master Training Specialist Mentor status establishing him as an expert in his craft.  His Navy background included work as an instructor, electronics technician, security program manager, undersea research and design technician, and more.  He holds a Bachelor’s degree in Applied Science and Technology with an emphasis in electronics and is pursuing a Master’s degree in Instructional Technology."
      }, 
      {
        "name": "Dr. Owen Redwood",
        "bio": "Dr. Owen Redwood is the Chief Research Officer at NARI. Dr. Redwood earned his M.S. and Ph.D. degrees in Computer Science from the Florida State University, focusing on vulnerability research and virtualization research of cyber physical systems. Dr. Redwood earned his B.S. in Computer Science from the Georgia Institute of Technology. His research background spans IT and OT vulnerability research, reverse engineering, cyber physical systems virtualization research, hybrid approaches for static/dynamic/symbolic analysis, physical-impact payload development, and automated exploitation and mitigation. Dr. Redwood also created and maintains the “Offensive Computer Security” online open-courseware which has been adopted by faculty members at over 20 universities and is the world’s top open-courseware on vulnerability research and exploitation. In a past life, Dr. Redwood was a member of the Raytheon Deep Red team for the DARPA Cyber Grand Challenge, where he focused on automating vulnerability discovery, vulnerability mitigation, and exploitation.  He also previously worked for Sandia National Labs and another government cybersecurity research and development organization focusing on securing critical infrastructure. Dr. Redwood’s past cyber physical system vulnerability research has covered devices in energy critical infrastructure, oil/gas critical infrastructure, maritime systems, vehicular systems, building automation systems, and more. Dr. Redwood has a Global Industrial Cyber Security Professional (GICSP) certification, and has passed the CISSP exam and is awaiting the CISSP certification award currently."
      }
    ],
    "description": "Hands-on exercises utilizing OT networks are used to develop the skill objectives of the course, including the fundamentals of triage, network hunting, and active defense in OT networks. Teamwork, communication, and proper application of these skills are required to pass the final exercise, where students must work together to identify and stop an active sabotage attack against an OT network. Students gain real-world experience in the fundamentals of BCS incident response on BACnet-based systemsand networks.",
    "extra": [
      "A basic understanding of BACnet protocol, covering BACnet objects, services, networking, vulnerabilities and attacks.",
      "A basic understanding of p • A basic understanding of physical dependencies in building control systems and how control systems interact with one another.",
      "A basic understanding of the attack surface and impact surface for building control systems.",
      "A basic understanding of triage and network analysis regarding incident response of building control systems.",
      "An ability to communicate effectively with OT engineers during incident response for control systems."
    ]
  }
]