[
  {
    "id": 1,
    "name": "Clay Dowling",
    "title": "Arduino Workshop Instructor",
    "bio": "Clay Dowling is a software consultant specializing in agile practices & extremem programming techniques. In his spare time he builds machines driven by microcontrollers & negotiates with his cats for access to the keyboard.",
    "image": ""
  }, {
    "id": 2,
    "name": "Nathan Schlehlein",
    "title": "Arduino Workshop Instructor",
    "bio": "Nathan Schlehlein is a wannabe problem solver who earns his living making dreams come true for people via software. A semi-recent transplant to the semi-bustling city of Des Moines, IA, he resides in the “pretty OK” western burbs with his three awesome kids, long-suffering wife, & hyperactive dog. He is an enthusiast of intriguing, historically significant, & / or dangerous technology & enjoys good scotch, beer with a back story, & a well-executed fake foreign accent.",
    "image": "nathan.jpeg"
  }, {
    "id": 3,
    "name": "Brad Miller",
    "title": "NARI Workshops Instructor",
    "bio": "Brad Miller is an instructor and testbed technician with Nebraska Applied Research Institute (NARI), where he trains attendees of NARIs cyber security courses and designs and develops testbeds for companies. He joined the NARI team in 2017 after retiring from the US Marine Corps. While he was on active duty, he maintained F-18 Hornets for Marine Aviation and had the opportunity to achieve his Master Training Specialist certification. Brad has instructed attendees from Cyber Protection Brigade, Iowa National Guard and Defense Threat Reduction Agency during courses and has worked with Honeywell and Siemens components during testbed development, among other distinctions in the cyber security field for NARI. Brad helps the building control systems (BCS) industry by giving facility and building engineers cutting edge training in BCS cyber security techniques. He also gives NARIs cyber engineers a platform with the testbeds, allowing them to develop new BCS hardening techniques and data.",
    "image": ""
  }, {
    "id": 4,
    "name": "Josh Bunstock",
    "title": "NARI Workshops Instructor",
    "bio": "Josh Bunstock is the Cyber Training and Instructional Design Lead at the Nebraska Applied Research Institute.  Josh has taken part in the development and delivery of four separate courses for NARI including Network Analysis, Executive Cyber Security, Building Control System Incident Response, and NIST Special Publication 800-171 Compliance for Businesses.  He joined the NARI team in July of 2017 after transitioning from 20 years of service in the Navy’s Submarine Force.  While in the Navy, Josh achieved Master Training Specialist Mentor status establishing him as an expert in his craft.  His Navy background included work as an instructor, electronics technician, security program manager, undersea research and design technician, and more.  He holds a Bachelor’s degree in Applied Science and Technology with an emphasis in electronics and is pursuing a Master’s degree in Instructional Technology.",
    "image": ""
  }, {
    "id": 5,
    "name": "Dr. Owen Redwood",
    "title": "NARI Workshops Subject Matter Expert",
    "bio": "Dr. Owen Redwood is the Chief Research Officer at NARI. Dr. Redwood earned his M.S. and Ph.D. degrees in Computer Science from the Florida State University, focusing on vulnerability research and virtualization research of cyber physical systems. Dr. Redwood earned his B.S. in Computer Science from the Georgia Institute of Technology. His research background spans IT and OT vulnerability research, reverse engineering, cyber physical systems virtualization research, hybrid approaches for static/dynamic/symbolic analysis, physical-impact payload development, and automated exploitation and mitigation. Dr. Redwood also created and maintains the “Offensive Computer Security” online open-courseware which has been adopted by faculty members at over 20 universities and is the world’s top open-courseware on vulnerability research and exploitation. In a past life, Dr. Redwood was a member of the Raytheon Deep Red team for the DARPA Cyber Grand Challenge, where he focused on automating vulnerability discovery, vulnerability mitigation, and exploitation.  He also previously worked for Sandia National Labs and another government cybersecurity research and development organization focusing on securing critical infrastructure. Dr. Redwood’s past cyber physical system vulnerability research has covered devices in energy critical infrastructure, oil/gas critical infrastructure, maritime systems, vehicular systems, building automation systems, and more. Dr. Redwood has a Global Industrial Cyber Security Professional (GICSP) certification, and has passed the CISSP exam and is awaiting the CISSP certification award currently.",
    "image": "owen.jpeg"
  }, {
    "id": 6,
    "name": "Alex Lauerman",
    "title": "Security Consultant",
    "bio": "Alex has had a lifelong interest in computer security and is thrilled to have a career in it.  He has spent the last decade breaking into applications, networks, and devices. He enjoys application security, cryptography, software defined radio, reverse engineering, exploitation, and developing tools that can help solve security problems at scale. Alex founded SecKC, which is a non-profit organization which is designed to foster information security in Kansas City.",
    "image": "tf_alex.jpg"
  }, {
    "id": 7,
    "name": "Tyler Rosonke",
    "title": "Security Consultant",
    "bio": "Tyler is a security professional based in Omaha, Nebraska. His main area of focus is in penetration testing. He loves learning and scripting his way out of a tight spot, which makes this area of security right up his alley. Tyler graduated from the University of Nebraska at Omaha with a B.S. in Information Assurance in 2014 and has been working in the offensive security roles ever since. Tyler is highly involved with the security community. He has contributed to open source projects, he has spoken at security conferences (DefCon), and he writes/operates the ZonkSec security blog. If Tyler is not banging his head against his monitor, you’ll likely find him in a garage banging his head against a vintage 2-stroke moped or wandering around in the great outdoors.",
    "image": "tf_tyler.jpg"
  }, {
    "id": 8,
    "name": "Matt South",
    "title": "Security Consultant",
    "bio": "Matt has been an amateur security enthusiast since childhood and was a regular 2600 attendee in high school. After graduating The University of Kansas with a B.S. in Computer Science, Matt spent 6 years as an IT Consultant to local businesses in Kansas City. In 2013, he combined his knowledge of business systems and love for security to become a penetration tester for TrustFoundry. Since then, he has hacked on hundreds of systems. He’s given talks at security events such as SecKC and TriKC. He also had the privilege to present a tool of his own design at BlackHat USA 2015 and 2017. When he’s not hacking, you can find Matt fishing with family, traveling with his wife, or killing plants in his garden.",
    "image": "tf_matt.jpg"
  }, {
    "id": 9,
    "name": "FPV Prowler Group",
    "title": "Drone Racing Group",
    "bio": "Team Prowler grew out of the extraordinary amounts of fun we have, and wanting to share that with others around the community. Currently we are located in Omaha, Nebraska and Council Bluffs, Iowa. Our goal is to bring people together, teach, and have one hell of a good time in the process! Hope you join us, either to fly, or by enjoying our videos and website. https://www.multigp.com/chapters/view/?chapter=Prowler-FPV",
    "image": "fpv.jpg"
  },  {
    "id": 10,
    "name": "Matt Virus",
    "title": "Cisco Systems Engineer",
    "bio": "Matt Virus (yes, real name) is an engineer @ Cisco (10+ years) , an above-average husband and father of 2, a fan of loud angry rock music, and a hardware junkie with tons of experience with build/hack projects.  Whatever “it” is -- it can be disassembled and examined…it can be made more secure, more functional and more use useful.  No fear of burned fingers, desks set on fire, or escape of the magic smoke here.  BS/MS in MIS and information assurance, former DoD forensic and malware analyst, firm believer of local control and auditability of software/firmware.  Lover of all things containerized and API-enabled, blackbelt in google-fu, passionate about facilitation, enablement, and helping people reach beyond their technical comfort zone. Fueled by monster energy. ",
    "image": ""
  }, {
    "id": 11,
    "name": "Samuel Curry",
    "title": "Security Consultant",
    "bio": "Samuel is a web application security researcher from Omaha, Nebraska. He has over two years of experience in developing web applications and four years of experience penetration testing them. Over the last three years, he has worked closely with organizations in identifying and reporting security vulnerabilities. In his free time, he runs a blog dedicated to security research and additionally has given talks regarding his work. Samuel is involved with local groups like DC402, NULLify, and OWASP Omaha. In the past, Samuel has participated in various bug bounty programs and competed in live hacking events organized by platforms like HackerOne and Bugcrowd. On the weekends, he helps organize University of Nebraska at Omaha’s Cyber Security club.",
    "image": "tf_sam.png"

  }
]

