[
  {
    "title": "TOOOL Lockpicking Village",
    "description": "Tired of staring at a monitor trying to hack your way through a computer...come try you hand [literally] at hacking hardware! The Open Organization Of Lockpickers [TOOOL] is set up and ready to give you a new kind of challenge. Gaining access has a different meaning here. TOOOL uses their knowledge to guide you through different types of locks, their vulnerabilities, and how to exploit them. Scrape pin tumblers instead of data!"
  },
  {
    "title": "Resume Village",
    "description": "Hack your career.  Whether you’re just starting out professionally in security, or looking to change things up the Kernelcon resume clinic is the perfect place to get constructive, honest advice on your resume and interviewing skills. First experienced recruitment volunteers will review your resume and give you constructive feedback on how to get beyond corporate filters and non-technical reviewers.  Next, a brief one-on-one interview with an experienced security hiring manager will give you a sandbox for testing your interviewing techniques.  After the interview, the hiring manager will discuss with you the details of your resume, skills, and interview and including areas to focus on for improvement. The Kernelcon resume clinic is a pressure-free environment, and your information won’t be given to any of the recruiters involved unless you provide it.  The clinic is free for attendees, but space is limited and slots will be filled on a first-come first-serve basis. Talent & Employers, Kernelcon is happy to provide job hiring/seeking bracelets.  If you’re looking to hire some of the best hackers in the area, or you are scoping out new opportunities grab a bracelet from the registration table.  Spark up a conversation with others who have the bracelet and see where it takes you."
  },
  {
    "title": "Chillout Room",
    "description": "Want a break from the con or just a place to relax?  Come hang out in the Chillout room with all your hacker friends!  We've got video games, music, free popcorn and other activities.  We will have Retro-Pis for all types of gaming emulation and maybe even a video game tournament or two!"
  }
]