[
  {
    "title": "Build Your Own Microcontroller Multi-Tool",
    "author": [
      {
        "id": 1,
        "name": "Clay Dowling"   
      }, 
      {
        "id": 2,
        "name": "Nathan Schlehlein"
      }
    ],
    "description": "Do you live with your head in a cloud? Do you fear small things? Is your mastery of virtualization and IAAS to the point where you haven't seen a real computer in months? Do you (most importantly) feel an unexplainable compulsion to open anti-static baggies handed to you by (almost) strangers and tinker with the contents therein? If so, have we got a workshop, nay, a way of life for you! In the Build Your Own Microcontroller Multi-Tool workshop, you and a handful of your newest and coolest friends will get to construct an ESP32 microcontroller-based device that you can take home! While constructing the device, we will discuss and tinker with each component to see what makes it tick. Then we'll boot things up and (provided the blue smoke hasn't escaped by this point) write some code, interface with sensors to measure the environment, tap into common communications buses for fun and profit, mess with wireless communications, and maybe even lose some time playing a video game.",
    "extra": [
      {
        "heading": "Take Aways:",
        "bullets": [
          "Users will get to keep the Microcontroller they spend the workshop building and modifying."
        ]
      }, 
      {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Arduino IDE - https://www.arduino.cc/en/Main/Software",
          "git knowledge"
        ]
      }
    ],
    "sessions": [
      {
        "day": "Friday",
        "time": "8am - 12pm",
        "spots": "30",
        "cost": "$70"
      },
      {
        "day": "Saturday",
        "time": "8am - 12pm",
        "spots": "30",
        "cost": "$70"
      }
    ]
  },
  {
    "title": "Network Analysis Workshop",
    "author": [
      {
        "id": 3,
        "name": "Brad Miller" 
      }, 
      {
        "id": 4,
        "name": "Josh Bunstock"
      }, 
      {
        "id": 5,
        "name": "Dr. Owen Redwood" 
      }
    ],
    "description": "Students learn how to use Wireshark to analyze multiple protocols within the common IT network stack. Students gain multiple hours of hands-on experience and essential skills for analyzing network traffic on Information Technology (IT) and Operational Technology (OT) networks.",
    "extra": [
      {
        "heading": "Students in this class will learn:",
        "bullets": [
          "A basic understanding of IT and OT networks including but not limited to the OSI model, the TCP/IP model, and network taps. Students also learn the differences between IT (information management) networks and OT (physical operations systems) networks and how to capture and analyze network traffic.",
          "A basic understanding of CANbus, BACnet, and other control system protocols and technologies.",
          "A basic understanding of how to use GrassMarlin to analyze network traffic and relationships.",
          "How to setup and configure Wireshark for use in packet capture and analysis.",
          "How to use Wireshark to capture packets from IT networks and perform analysis of captured packets, as well as access and analyze network traffic commonly found on IT and OT networks."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Wireshark installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Friday",
        "time": "8am - 5pm",
        "spots": "30",
        "cost": "$30"
      }
    ]
  },
  {
    "title": "An Introduction to Hardware Hacking and IOT",
    "author": [
      {
        "id": 10,
        "name": "Matt Virus" 
      }
    ],
    "description": "In this hands-on hacking village, users will be walked through modifying a (minimally) functional smart-home outlet plug. In its default state, the smart plug runs feature-limited, insecure firmware and software that depends on cloud connections and, in some cases, beacons to an external address in China. We will replace the software with open-source pieces and configure the plug to run with 100% local-only, non-cloud, control. Users will also be walked-through connecting the newly converted plug to a home-automation platform for software control via MQTT which enables web-based control, voice-based control, and control of state by a physical button.",
    "extra": [
      {
        "heading": "Take Aways:",
        "bullets": [
          "Users will get to keep the plug they spend the workshop modifying. "
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Soldering irons, supplies, laptops, and all adapters will be provided.",
          "A live home-assistant environment will be available for demo/test as well."
        ]
      }
    ],    
    "sessions": [
      {
        "day": "Friday",
        "time": "1pm - 2pm",
        "spots": "30",
        "cost": "$20"
      }, 
      {
        "day": "Friday",
        "time": "3pm - 4pm",
        "spots": "30",
        "cost": "$20"
      }
    ]
  },
  {
    "title": "Building Control System - Incident Response",
    "author": [
      {
        "id": 3,
        "name": "Brad Miller"
      }, 
      {
        "id": 4,
        "name": "Josh Bunstock"
      }, 
      {
        "id": 5,
        "name": "Dr. Owen Redwood"
      }
    ],
    "description": "Hands-on exercises utilizing OT networks are used to develop the skill objectives of the course, including the fundamentals of triage, network hunting, and active defense in OT networks. Teamwork, communication, and proper application of these skills are required to pass the final exercise, where students must work together to identify and stop an active sabotage attack against an OT network. Students gain real-world experience in the fundamentals of BCS incident response on BACnet-based systems and networks.",
    "extra": [
      {
        "heading": "Students in this class will learn:",
        "bullets": [
          "A basic understanding of BACnet protocol, covering BACnet objects, services, networking, vulnerabilities and attacks.",
          "A basic understanding of physical dependencies in building control systems and how control systems interact with one another.",
          "A basic understanding of the attack surface and impact surface for building control systems.",
          "A basic understanding of triage and network analysis regarding incident response of building control systems.",
          "An ability to communicate effectively with OT engineers during incident response for control systems."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Wireshark installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Saturday",
        "time": "8am - 5pm",
        "spots": "30",
        "cost": "$30"
      }
    ]
  },
  {
    "title": "Introduction to Web Application Penetration Testing",
    "author": [
      {
        "id": 6,
        "name": "Alex Lauerman"
      },
      {
        "id": 7,
        "name": "Tyler Rosonke"
      },
      {
        "id": 8,
        "name": "Matt South"
      },
      {
        "id": 11,
        "name": "Samuel Curry"
      }
    ],
    "description": "Learn the tools and techniques for conducting a web application penetration test. Get your hands dirty with HTTP and Burp Suite. This workshop will provide a solid introduction to web application penetration testing. This class is designed for those with little to no web application penetration testing experience, although it will move quickly. This class will include hands on challenges where attendees use skills acquired during the class to exploit web applications. Attendees will walk away with a basic understanding of the tools and processes for conducting a web application penetration test.",
    "extra": [
      {
        "heading": "Prerequisites:",
        "bullets": [
          "Basic knowledge of HTTP requests and responses, and any web application programming experience will be helpful, but is not required."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Firefox, Java, and virtualization software (VMWare/Vbox) installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Saturday",
        "time": "1pm - 5pm",
        "spots": "SOLD OUT",
        "cost": "$30"
      }
    ]
  },
  {
    "title": "FPV Drone Build-n-Race Workshop",
    "author": [
      {
        "id": 9,
        "name": "Mike Lollis"
      },
      {
        "id": 9,
        "name": "FPV Prowler Group"
      }
    ],
    "description": "FPV Drones are not the off-the-shelf toys that show up at Christmas time, and they're not the heavy, expensive aerial photography drones that basically fly for you... these drones are meant for racing. In this workshop we will cover the basics of FPV Drones and piloting. We will start from scratch, physically assembling an indoor racing drone, programming the on-board controller, and ultimately racing against other attendees.",
    "extra": [
      {
        "heading": "Take Aways:",
        "bullets": [
          "Workshop participants will take home the drone, controller, and FPV goggles - everything is included!"
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with BetaFlight installed.  Note: You do not need to know how to use BetaFlight - we will cover that."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Saturday",
        "time": "8am - 12pm",
        "spots": "30",
        "cost": "$210"
      }
    ]
  }
]
