[
  {
    "title": "Build Your Own Microcontroller Multi-Tool",
    "author": [
      {
        "id": 1,
        "name": "Clay Dowling"   
      }, 
      {
        "id": 2,
        "name": "Nathan Schlehlein"
      }
    ],
    "description": "Do you live with your head in a cloud? Do you fear small things? Is your mastery of virtualization and IAAS to the point where you haven't seen a real computer in months? Do you (most importantly) feel an unexplainable compulsion to open anti-static baggies handed to you by (almost) strangers and tinker with the contents therein? If so, have we got a workshop, nay, a way of life for you! In the Build Your Own Microcontroller Multi-Tool workshop, you and a handful of your newest and coolest friends will get to construct an ESP32 microcontroller-based device that you can take home! While constructing the device, we will discuss and tinker with each component to see what makes it tick. Then we'll boot things up and (provided the blue smoke hasn't escaped by this point) write some code, interface with sensors to measure the environment, tap into common communications buses for fun and profit, mess with wireless communications, and maybe even lose some time playing a video game.",
    "extra": [
      {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Visual Studio Code installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Friday",
        "time": "8am - 12pm",
        "spots": "30",
        "cost": "$70"
      },
      {
        "day": "Saturday",
        "time": "8am - 12pm",
        "spots": "30",
        "cost": "$70"
      }
    ]
  },
  {
    "title": "Network Analysis Workshop",
    "author": [
      {
        "id": 3,
        "name": "Brad Miller" 
      }, 
      {
        "id": 4,
        "name": "Josh Bunstock"
      }, 
      {
        "id": 5,
        "name": "Dr. Owen Redwood" 
      }
    ],
    "description": "Students learn how to use Wireshark to analyze multiple protocols within the common IT network stack. Students gain multiple hours of hands-on experience and essential skills for analyzing network traffic on Information Technology (IT) and Operational Technology (OT) networks.",
    "extra": [
      {
        "heading": "Students in this class will learn:",
        "bullets": [
          "A basic understanding of IT and OT networks including but not limited to the OSI model, the TCP/IP model, and network taps. Students also learn the differences between IT (information management) networks and OT (physical operations systems) networks and how to capture and analyze network traffic.",
          "A basic understanding of CANbus, BACnet, and other control system protocols and technologies.",
          "A basic understanding of how to use GrassMarlin to analyze network traffic and relationships.",
          "How to setup and conögure Wireshark for use in packet capture and analysis.",
          "How to use Wireshark to capture packets from IT networks and perform analysis of captured packets, as well as access and analyze network traffic commonly found on IT and OT networks."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Wireshark installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Friday",
        "time": "8am - 5pm",
        "spots": "30",
        "cost": "$30"
      }
    ]
  },
  {
    "title": "Building Control System - Incident Response",
    "author": [
      {
        "id": 3,
        "name": "Brad Miller"
      }, 
      {
        "id": 4,
        "name": "Josh Bunstock"
      }, 
      {
        "id": 5,
        "name": "Dr. Owen Redwood"
      }
    ],
    "description": "Hands-on exercises utilizing OT networks are used to develop the skill objectives of the course, including the fundamentals of triage, network hunting, and active defense in OT networks. Teamwork, communication, and proper application of these skills are required to pass the final exercise, where students must work together to identify and stop an active sabotage attack against an OT network. Students gain real-world experience in the fundamentals of BCS incident response on BACnet-based systemsand networks.",
    "extra": [
      {
        "heading": "Students in this class will learn:",
        "bullets": [
          "A basic understanding of BACnet protocol, covering BACnet objects, services, networking, vulnerabilities and attacks.",
          "A basic understanding of physical dependencies in building control systems and how control systems interact with one another.",
          "A basic understanding of the attack surface and impact surface for building control systems.",
          "A basic understanding of triage and network analysis regarding incident response of building control systems.",
          "An ability to communicate effectively with OT engineers during incident response for control systems."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Wireshark installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Saturday",
        "time": "8am - 5pm",
        "spots": "30",
        "cost": "$30"
      }
    ]
  },
  {
    "title": "Introduction to Web Application Penetration Testing",
    "author": [
      {
        "id": 6,
        "name": "Alex Lauerman"
      },
      {
        "id": 7,
        "name": "Tyler Rosonke"
      },
      {
        "id": 8,
        "name": "Matt South"
      }
    ],
    "description": "Learn the tools and techniques for conducting a web application penetration test. Get your hands dirty with HTTP and Burp Suite. This workshop will provide a solid introduction to web application penetration testing. This class is designed for those with little to no web application penetration testing experience, although it will move quickly. This class will include hands on challenges where attendees use skills acquired during the class to exploit web applications. Attendees will walk away with a basic understanding of the tools and processes for conducting a web application penetration test.",
    "extra": [
      {
        "heading": "Prerequisites:",
        "bullets": [
          "Basic knowledge of HTTP requests and responses, and any web application programming experience will be helpful, but is not required."
        ]
      }, {
        "heading": "Materials:",
        "bullets": [
          "Laptop with Firefox, Java, and virtualization software (VMWare/Vbox) installed."
        ]
      }
    ],
    "sessions": [
      {
        "day": "Saturday",
        "time": "1pm - 5pm",
        "spots": "30",
        "cost": "$30"
      }
    ]
  }
]